zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA567/startup_MCXA567.c

//*****************************************************************************
// MCXA567 startup code
//
// Version : 070426
//*****************************************************************************
//
// Copyright 2016-2026 NXP
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************
#include <stdint.h>

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC push_options
#pragma GCC optimize("Og")
#endif //(__GNUC__)
#endif //(DEBUG)

#if defined(__cplusplus)
#if defined(__MCUXPRESSO)
#if defined(__REDLIB__)
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
extern void __libc_init_array(void);
}
#endif //(__REDLIB__)
#endif //(__MCUXPRESSO)
#endif //(__cplusplus)

#define WEAK __attribute__((weak))
#if defined(__MCUXPRESSO)
#define WEAK_AV __attribute__((weak, section(".after_vectors")))
#else
#define WEAK_AV __attribute__((weak))
#endif //(__MCUXPRESSO)
#define ALIAS(f) __attribute__((weak, alias(#f)))

//*****************************************************************************
#if defined(__cplusplus)
extern "C" {
#endif //(__cplusplus)

//*****************************************************************************
// Variable to store CRP value in. Will be placed automatically
// by the linker when "Enable Code Read Protect" selected.
// See crp.h header for more information
//*****************************************************************************
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
extern void SystemInit(void);

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
#if defined(__MCUXPRESSO)
void ResetISR(void);
#else
void Reset_Handler(void);
#endif //(__MCUXPRESSO)
void Reset_Handler_C(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SecureFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void DefaultISR(void);
WEAK void DefaultISR1(uint32_t instance);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void Reserved16_IRQHandler(void);
WEAK void CMC_IRQHandler(void);
WEAK void DMA0_CH0_IRQHandler(void);
WEAK void DMA0_CH1_IRQHandler(void);
WEAK void DMA0_CH2_IRQHandler(void);
WEAK void DMA0_CH3_IRQHandler(void);
WEAK void DMA0_CH4_IRQHandler(void);
WEAK void DMA0_CH5_IRQHandler(void);
WEAK void DMA0_CH6_IRQHandler(void);
WEAK void DMA0_CH7_IRQHandler(void);
WEAK void ERM0_SINGLE_BIT_IRQHandler(void);
WEAK void ERM0_MULTI_BIT_IRQHandler(void);
WEAK void FMU0_IRQHandler(void);
WEAK void GLIKEY0_IRQHandler(void);
WEAK void MBC0_IRQHandler(void);
WEAK void SCG0_IRQHandler(void);
WEAK void SPC0_IRQHandler(void);
WEAK void TDET_IRQHandler(void);
WEAK void WUU0_IRQHandler(void);
WEAK void CAN0_IRQHandler(void);
WEAK void CAN1_IRQHandler(void);
WEAK void Reserved37_IRQHandler(void);
WEAK void Reserved38_IRQHandler(void);
WEAK void FLEXIO_IRQHandler(void);
WEAK void I3C0_IRQHandler(void);
WEAK void I3C1_IRQHandler(void);
WEAK void LPI2C0_IRQHandler(void);
WEAK void LPI2C1_IRQHandler(void);
WEAK void LPSPI0_IRQHandler(void);
WEAK void LPSPI1_IRQHandler(void);
WEAK void LPSPI2_IRQHandler(void);
WEAK void LPUART0_IRQHandler(void);
WEAK void LPUART1_IRQHandler(void);
WEAK void LPUART2_IRQHandler(void);
WEAK void LPUART3_IRQHandler(void);
WEAK void LPUART4_IRQHandler(void);
WEAK void Reserved52_IRQHandler(void);
WEAK void Reserved53_IRQHandler(void);
WEAK void CDOG0_IRQHandler(void);
WEAK void CTIMER0_IRQHandler(void);
WEAK void CTIMER1_IRQHandler(void);
WEAK void CTIMER2_IRQHandler(void);
WEAK void CTIMER3_IRQHandler(void);
WEAK void CTIMER4_IRQHandler(void);
WEAK void Reserved60_IRQHandler(void);
WEAK void Reserved61_IRQHandler(void);
WEAK void Reserved62_IRQHandler(void);
WEAK void Reserved63_IRQHandler(void);
WEAK void Reserved64_IRQHandler(void);
WEAK void Reserved65_IRQHandler(void);
WEAK void Reserved66_IRQHandler(void);
WEAK void Reserved67_IRQHandler(void);
WEAK void Reserved68_IRQHandler(void);
WEAK void Reserved69_IRQHandler(void);
WEAK void FREQME0_IRQHandler(void);
WEAK void LPTMR0_IRQHandler(void);
WEAK void Reserved72_IRQHandler(void);
WEAK void OS_EVENT_IRQHandler(void);
WEAK void WAKETIMER0_IRQHandler(void);
WEAK void UTICK0_IRQHandler(void);
WEAK void WWDT0_IRQHandler(void);
WEAK void WWDT1_IRQHandler(void);
WEAK void ADC0_IRQHandler(void);
WEAK void ADC1_IRQHandler(void);
WEAK void CMP0_IRQHandler(void);
WEAK void Reserved81_IRQHandler(void);
WEAK void Reserved82_IRQHandler(void);
WEAK void DAC0_IRQHandler(void);
WEAK void DAC1_IRQHandler(void);
WEAK void Reserved85_IRQHandler(void);
WEAK void Reserved86_IRQHandler(void);
WEAK void GPIO0_IRQHandler(void);
WEAK void GPIO1_IRQHandler(void);
WEAK void GPIO2_IRQHandler(void);
WEAK void GPIO3_IRQHandler(void);
WEAK void GPIO4_IRQHandler(void);
WEAK void GPIO5_IRQHandler(void);
WEAK void LPI2C2_IRQHandler(void);
WEAK void LPI2C3_IRQHandler(void);
WEAK void Reserved95_IRQHandler(void);
WEAK void Reserved96_IRQHandler(void);
WEAK void Reserved97_IRQHandler(void);
WEAK void Reserved98_IRQHandler(void);
WEAK void Reserved99_IRQHandler(void);
WEAK void Reserved100_IRQHandler(void);
WEAK void Reserved101_IRQHandler(void);
WEAK void Reserved102_IRQHandler(void);
WEAK void Reserved103_IRQHandler(void);
WEAK void Reserved104_IRQHandler(void);
WEAK void ESPI_IRQHandler(void);
WEAK void ETHERNET_IRQHandler(void);
WEAK void ETHERNET_PMT_IRQHandler(void);
WEAK void Reserved108_IRQHandler(void);
WEAK void TENBASET_PHY0_IRQHandler(void);
WEAK void I3C2_IRQHandler(void);
WEAK void LPUART5_IRQHandler(void);
WEAK void Reserved112_IRQHandler(void);
WEAK void LPSPI3_IRQHandler(void);
WEAK void LPSPI4_IRQHandler(void);
WEAK void LPSPI5_IRQHandler(void);
WEAK void LPI2C4_IRQHandler(void);
WEAK void I3C3_IRQHandler(void);
WEAK void Reserved118_IRQHandler(void);
WEAK void USB1_HS_IRQHandler(void);
WEAK void USB1_HS_PHY_IRQHandler(void);
WEAK void Reserved121_IRQHandler(void);
WEAK void FLEXSPI0_IRQHandler(void);
WEAK void Reserved123_IRQHandler(void);
WEAK void SMARTDMA_IRQHandler(void);
WEAK void CDOG1_IRQHandler(void);
WEAK void PKC_IRQHandler(void);
WEAK void SGI_IRQHandler(void);
WEAK void Reserved128_IRQHandler(void);
WEAK void TRNG0_IRQHandler(void);
WEAK void SECURE_ERR_IRQHandler(void);
WEAK void SEC_HYPERVISOR_CALL_IRQHandler(void);
WEAK void Reserved132_IRQHandler(void);
WEAK void Reserved133_IRQHandler(void);
WEAK void Reserved134_IRQHandler(void);
WEAK void RTC_IRQHandler(void);
WEAK void Reserved136_IRQHandler(void);
WEAK void Reserved137_IRQHandler(void);
WEAK void DGDET0_IRQHandler(void);
WEAK void EWM_IRQHandler(void);
WEAK void TSI_END_OF_SCAN_IRQHandler(void);
WEAK void TSI_OUT_OF_SCAN_IRQHandler(void);
WEAK void GPIO0_1_IRQHandler(void);
WEAK void GPIO1_1_IRQHandler(void);
WEAK void GPIO2_1_IRQHandler(void);
WEAK void GPIO3_1_IRQHandler(void);
WEAK void GPIO4_1_IRQHandler(void);
WEAK void GPIO5_1_IRQHandler(void);
WEAK void Reserved148_IRQHandler(void);
WEAK void ITRC0_IRQHandler(void);
WEAK void DMA0_CH8_IRQHandler(void);
WEAK void DMA0_CH9_IRQHandler(void);
WEAK void DMA0_CH10_IRQHandler(void);
WEAK void DMA0_CH11_IRQHandler(void);
WEAK void Reserved154_IRQHandler(void);
WEAK void Reserved155_IRQHandler(void);
WEAK void Reserved156_IRQHandler(void);
WEAK void Reserved157_IRQHandler(void);
WEAK void DMA1_CH0_IRQHandler(void);
WEAK void DMA1_CH1_IRQHandler(void);
WEAK void DMA1_CH2_IRQHandler(void);
WEAK void DMA1_CH3_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the DefaultISR, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void Reserved16_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMC_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH4_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH5_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH6_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH7_DriverIRQHandler(void) ALIAS(DefaultISR);
void ERM0_SINGLE_BIT_DriverIRQHandler(void) ALIAS(DefaultISR);
void ERM0_MULTI_BIT_DriverIRQHandler(void) ALIAS(DefaultISR);
void FMU0_DriverIRQHandler(void) ALIAS(DefaultISR);
void GLIKEY0_DriverIRQHandler(void) ALIAS(DefaultISR);
void MBC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SCG0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SPC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void TDET_DriverIRQHandler(void) ALIAS(DefaultISR);
void WUU0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CAN0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CAN1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved37_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved38_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXIO_DriverIRQHandler(void) ALIAS(DefaultISR);
void I3C0_DriverIRQHandler(void) ALIAS(DefaultISR);
void I3C1_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C1_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI1_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI2_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART1_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART2_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART3_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART4_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved52_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved53_DriverIRQHandler(void) ALIAS(DefaultISR);
void CDOG0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER1_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER2_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER3_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER4_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved60_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved61_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved62_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved63_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved64_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved65_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved66_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved67_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved68_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved69_DriverIRQHandler(void) ALIAS(DefaultISR);
void FREQME0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPTMR0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved72_DriverIRQHandler(void) ALIAS(DefaultISR);
void OS_EVENT_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKETIMER0_DriverIRQHandler(void) ALIAS(DefaultISR);
void UTICK0_DriverIRQHandler(void) ALIAS(DefaultISR);
void WWDT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void WWDT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC1_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMP0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved81_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved82_DriverIRQHandler(void) ALIAS(DefaultISR);
void DAC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void DAC1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved85_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved86_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO0_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO1_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO2_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO3_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO4_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO5_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C2_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C3_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved95_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved96_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved97_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved98_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved99_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved100_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved101_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved102_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved103_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved104_DriverIRQHandler(void) ALIAS(DefaultISR);
void ESPI_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void ETHERNET_DriverIRQHandler(void) ALIAS(DefaultISR);
void ETHERNET_PMT_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved108_DriverIRQHandler(void) ALIAS(DefaultISR);
void TENBASET_PHY0_DriverIRQHandler(void) ALIAS(DefaultISR);
void I3C2_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART5_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved112_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI3_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI4_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI5_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C4_DriverIRQHandler(void) ALIAS(DefaultISR);
void I3C3_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved118_DriverIRQHandler(void) ALIAS(DefaultISR);
void USB1_HS_DriverIRQHandler(void) ALIAS(DefaultISR);
void USB1_HS_PHY_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved121_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXSPI0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved123_DriverIRQHandler(void) ALIAS(DefaultISR);
void SMARTDMA_DriverIRQHandler(void) ALIAS(DefaultISR);
void CDOG1_DriverIRQHandler(void) ALIAS(DefaultISR);
void PKC_DriverIRQHandler(void) ALIAS(DefaultISR);
void SGI_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved128_DriverIRQHandler(void) ALIAS(DefaultISR);
void TRNG0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SECURE_ERR_DriverIRQHandler(void) ALIAS(DefaultISR);
void SEC_HYPERVISOR_CALL_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved132_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved133_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved134_DriverIRQHandler(void) ALIAS(DefaultISR);
void RTC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved136_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved137_DriverIRQHandler(void) ALIAS(DefaultISR);
void DGDET0_DriverIRQHandler(void) ALIAS(DefaultISR);
void EWM_DriverIRQHandler(void) ALIAS(DefaultISR);
void TSI_END_OF_SCAN_DriverIRQHandler(void) ALIAS(DefaultISR);
void TSI_OUT_OF_SCAN_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO0_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO1_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO2_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO3_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO4_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO5_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved148_DriverIRQHandler(void) ALIAS(DefaultISR);
void ITRC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH8_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH9_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH10_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_CH11_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved154_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved155_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved156_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved157_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA1_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA1_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA1_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA1_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void __main(void);
#elif defined(__MCUXPRESSO)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern int main(void);
#endif //(__REDLIB__)
#elif defined(__ICCARM__)
extern void __iar_program_start(void);
#elif defined(__GNUC__)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern void _start(void);
#endif //(__REDLIB__)
#else
#error Unsupported toolchain!
#endif //(__MCUXPRESSO)

//*****************************************************************************
// External declaration for the pointer from the Linker Script
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Base[];
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Limit[];
#define _vStackTop  Image$$ARM_LIB_STACK$$ZI$$Limit
#define _vStackBase Image$$ARM_LIB_STACK$$ZI$$Base
#elif defined(__MCUXPRESSO)
extern void _vStackTop(void);
extern void _vStackBase(void);
#define Reset_Handler ResetISR // To be compatible with other compilers
#elif defined(__ICCARM__)
#pragma segment = "CSTACK"
#define _vStackTop  __section_end("CSTACK")
#define _vStackBase __section_begin("CSTACK")
#elif defined(__GNUC__)
extern uint32_t __StackTop[];
extern uint32_t __StackLimit[];

